Revit 2027 API
Application.NewReferencePointArray Method
Creates an empty array that can store ReferencePoint objects.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ReferencePointArray NewReferencePointArray()
Public Function NewReferencePointArray As ReferencePointArray
public:
ReferencePointArray^ NewReferencePointArray()
member NewReferencePointArray : unit -> ReferencePointArray
Return Value
ReferencePointArray
An empty array that can hold ReferencePoint objects.
Remarks
This method can be used to create an array that can hold ReferencePoint objects. This array can be then passed to methods, such as NewCurveByPoints, to represent two or more PointElements.
See Also
Reference
Application Class
Autodesk.Revit.Creation Namespace